In [12]:
import pandas as pd

df = pd.read_csv('../data/raw/train.csv')
print(f"df.shape: {df.shape}")
print(f"df.dtypes:  \n{df.dtypes}")
df.head()

df.shape: (891, 12)
df.dtypes:
PassengerId      int64
Survived         int64
Pclass           int64
Name               str
Sex                str
Age            float64
SibSp            int64
Parch            int64
Ticket             str
Fare           float64
Cabin              str
Embarked           str
dtype: object

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Find NaN and duplicated**

In [13]:
missing_values = df.isna().sum().sort_values(ascending=False)
duplicated_values = df.duplicated().sum()

print(f"Missing values:\n{missing_values}", end="\n\n")
print(f"Duplicated values:\n{duplicated_values}")

Missing values:
Cabin          687
Age            177
Embarked         2
PassengerId      0
Name             0
Pclass           0
Survived         0
Sex              0
Parch            0
SibSp            0
Fare             0
Ticket           0
dtype: int64

Duplicated values:
0

**Drop unnecessary columns**

In [14]:
cols_to_drop = ["PassengerId", "Name", "Ticket", "Cabin"]
df = df.copy()
df = df.drop(columns=cols_to_drop)
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

**outliers**

In [25]:
num_cols = ["Age", "Fare"]
for col in num_cols:
    print(f"\n{col}")
    print(df.groupby("Sex")[col].agg(["min", "max", "mean", "std", "count"]))

Age
         min   max       mean        std  count
Sex
female  0.75  63.0  27.915709  14.110146    261
male    0.42  80.0  30.726645  14.678201    453

Fare
         min       max       mean        std  count
Sex
female  6.75  512.3292  44.479818  57.997698    314
male    0.00  512.3292  25.523893  43.138263    577